NMMI/SoftHand2/firmware.cydsn/Generated_Source/PSoC3/ADC_1.c
/*******************************************************************************
* Function Name: ADC_1_Stop
********************************************************************************
*
* Summary:
*  This function stops and powers down the ADC component and the internal
*  clock if the external clock is not selected. If an external clock is
*  used, it is up to the designer to power down the external clock it
*  required.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_1_Stop(void) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Stop conversions */
    ADC_1_DEC_CR_REG &= (uint8)~ADC_1_DEC_START_CONV;
    ADC_1_DEC_SR_REG |=  ADC_1_DEC_INTR_CLEAR;

    /* Disable PRES, Disable power to VCMBUF0, REFBUF0 and REFBUF1,
       enable PRES */
    ADC_1_RESET_CR4_REG |= ADC_1_IGNORE_PRESA1;
    ADC_1_RESET_CR5_REG |= ADC_1_IGNORE_PRESA2;

    ADC_1_DSM_CR17_REG &= (uint8)~(ADC_1_DSM_EN_BUF_VREF | ADC_1_DSM_EN_BUF_VCM);
    ADC_1_DSM_REF0_REG &= (uint8)~ADC_1_DSM_EN_BUF_VREF_INN;

    /* Wait for 3 microseconds. */
    CyDelayUs(ADC_1_PRES_DELAY_TIME);

    /* Enable the press circuit */
    ADC_1_RESET_CR4_REG &= (uint8)~ADC_1_IGNORE_PRESA1;
    ADC_1_RESET_CR5_REG &= (uint8)~ADC_1_IGNORE_PRESA2;

    /* Disable power to the ADC */
    ADC_1_PWRMGR_DSM_REG &= (uint8)~ADC_1_ACT_PWR_DSM_EN;

    /* Disable power to Decimator block */
    ADC_1_PWRMGR_DEC_REG &= (uint8)~ADC_1_ACT_PWR_DEC_EN;

    /* Disable alternative active power to the ADC */
    ADC_1_STBY_PWRMGR_DEC_REG &= (uint8)~ADC_1_STBY_PWR_DEC_EN;
    ADC_1_STBY_PWRMGR_DSM_REG &= (uint8)~ADC_1_STBY_PWR_DSM_EN;

   /* Disable negative pumps for DSM  */
    ADC_1_PUMP_CR1_REG &= (uint8)~(ADC_1_PUMP_CR1_CLKSEL | ADC_1_PUMP_CR1_FORCE );

    /* This is only valid if there is an internal clock */
    #if(ADC_1_DEFAULT_INTERNAL_CLK)
        ADC_1_PWRMGR_CLK_REG &= (uint8)~ADC_1_ACT_PWR_CLK_EN;
        ADC_1_STBY_PWRMGR_CLK_REG &= (uint8)~ADC_1_STBY_PWR_CLK_EN;
    #endif /* ADC_1_DEFAULT_INTERNAL_CLK */

    /* Disable Modulator Chopping */
    ADC_1_DSM_CR2_REG &= (uint8)~ADC_1_DSM_MOD_CHOP_EN;
    /* Disable power to charge pump clock */
    ADC_1_PWRMGR_CHARGE_PUMP_CLK_REG &= (uint8)~ADC_1_ACT_PWR_CHARGE_PUMP_CLK_EN;
    ADC_1_STBY_PWRMGR_CHARGE_PUMP_CLK_REG &= (uint8)~ADC_1_STBY_PWR_CHARGE_PUMP_CLK_EN;
    
    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: ADC_1_SetBufferGain
********************************************************************************
*
* Summary:
*  Sets input buffer gain.
*
* Parameters:
*  gain:  Two bit value to select a gain of 1, 2, 4, or 8.
*
* Return:
*  None
*
*******************************************************************************/
void ADC_1_SetBufferGain(uint8 gain) 
{
    uint8 tmpReg;
    tmpReg = ADC_1_DSM_BUF1_REG & (uint8)~ADC_1_DSM_GAIN_MASK;
    tmpReg |= (uint8)(gain << ADC_1_DSM_GAIN_SHIFT) & ADC_1_DSM_GAIN_MASK;
    ADC_1_DSM_BUF1_REG = tmpReg;
}


/*******************************************************************************
* Function Name: ADC_1_SetCoherency
********************************************************************************
*
* Summary:
*  This function allows the user to change which of the ADC's 3 word
*  result will trigger a coherency unlock. The ADC's result will not be
*  updated until the set byte is read either by the ADC or DMA. 
*  By default the LSB is the coherency byte for right alignment data format. 
*  The middle or high byte is set automatically depend on left alignment 
*  configuration for DMA data transfer.
*  If DMA or if a custom API requires different byte to be read the last,
*  this API should be used to set the last byte of the ADC result that is read. 
*  If a multibyte read is performed either by DMA or the ARM processor, the
*  coherency can be set to any byte in the last word read.
*
* Parameters:
*  coherency:  Two bit value to set the coherency bit.
*           00-Coherency checking off
*           01-low byte is key byte
*           02-middle byte is the key byte
*           03-high byte is the key byte
*
* Return:
*  None
*
*******************************************************************************/
void ADC_1_SetCoherency(uint8 coherency) 
{
    uint8 tmpReg;

    tmpReg = ADC_1_DEC_COHER_REG & (uint8)~ADC_1_DEC_SAMP_KEY_MASK;
    tmpReg |= coherency & ADC_1_DEC_SAMP_KEY_MASK;
    ADC_1_DEC_COHER_REG = tmpReg;
}


/*******************************************************************************
* Function Name: ADC_1_SetGCOR
********************************************************************************
*
* Summary:
*  Calculates a new GCOR value and writes it into the GCOR register. 
*  The GCOR value is a 16-bit value that represents a gain of 0 to 2. 
*  The ADC result is multiplied by this value before it is placed in the ADC 
*  output registers. The numerical format for the GCOR value is:
*  0x0000 -> 0.000
*  0x8000 -> 1.000
*  0xFFFF -> 1.99997
*  When executing the function, the old GCOR value is multiplied by
*  gainAdjust and reloaded into the GCOR register.
*
* Parameters:
*  gainAdjust:  floating point value to set GCOR registers.
*
* Return:
*  uint8: 0 - if GCOR value is within the expected range.
*         1 - the correction value is outside GCOR value range of
*             0.00 to 1.9999.
*
* Side Effects:  The GVAL register is set to the amount of valid bits in the
*                GCOR  register minus one. If GVAL is 15 (0x0F), all 16 bits
*                of the GCOR registers will be valid. If for example GVAL is
*                11 (0x0B) only 12 bits will be valid. The least 4 bits will
*                be lost when the GCOR value is shifted 4 places to the right.
*
******************************************************************************/
uint8 ADC_1_SetGCOR(float32 gainAdjust) 
{
    uint16 tmpReg;
    uint8 status;
    float32 tmpValue;

    tmpReg = ADC_1_gcor[ADC_1_Config - 1u].gcor;
    tmpValue = ((float32)tmpReg / (float32)ADC_1_IDEAL_GAIN_CONST);
    tmpValue = tmpValue * gainAdjust;

    if (tmpValue > 1.9999)
    {
        status = 1u;
    }
    else
    {
        tmpValue *= (float32)ADC_1_IDEAL_GAIN_CONST;
		tmpReg = (uint16)tmpValue;
        CY_SET_REG16(ADC_1_DEC_GCOR_16B_PTR, tmpReg);
        /* Update gain array to be used by SelectConfiguration() API */
       ADC_1_gcor[ADC_1_Config - 1u].gcor = tmpReg;

        status = 0u;

