NMMI/SoftHand2/firmware.cydsn/Generated_Source/PSoC3/ADC_1.c
/*******************************************************************************
* Function Name: ADC_1_CountsTo_mVolts
********************************************************************************
*
* Summary:
*  Converts the ADC counts output to mVolts as a 16-bit integer. For
*  example, if the ADC measured 0.534 volts, the return value would
*  be 534 mVolts.
*
* Parameters:
*  int32: adcCounts Result from the ADC conversion.
*
* Return:
*  int16:  Result in mVolts
*
* Global variables:
*  ADC_1_CountsPerVolt:  used to convert ADC counts to mVolts.
*  ADC_1_Offset:  Used as the offset while converting ADC counts
*   to mVolts.
*
*******************************************************************************/
int16 ADC_1_CountsTo_mVolts(int32 adcCounts) 
{

    int16 mVolts;

    /* Convert adcCounts to the right align if left option selected */
    #if(ADC_1_CFG1_DEC_DIV != 0)
        if(ADC_1_Config == ADC_1_CFG1)
        {
            adcCounts /= ADC_1_CFG1_DEC_DIV;
        }
    #endif /* ADC_1_CFG1_DEC_DIV */
    #if((ADC_1_CFG2_DEC_DIV != 0) && (ADC_1_DEFAULT_NUM_CONFIGS > 1))
        if(ADC_1_Config == ADC_1_CFG2)
        {
            adcCounts /= ADC_1_CFG2_DEC_DIV;
        }
    #endif /* ADC_1_CFG2_DEC_DIV */
    #if((ADC_1_CFG3_DEC_DIV != 0) && (ADC_1_DEFAULT_NUM_CONFIGS > 2))
        if(ADC_1_Config == ADC_1_CFG3)
        {
            adcCounts /= ADC_1_CFG3_DEC_DIV;
        }
    #endif /* ADC_1_CFG2_DEC_DIV */
    #if((ADC_1_CFG4_DEC_DIV != 0) && (ADC_1_DEFAULT_NUM_CONFIGS > 3))
        if(ADC_1_Config == ADC_1_CFG4)
        {
            adcCounts /= ADC_1_CFG4_DEC_DIV;
        }
    #endif /* ADC_1_CFG2_DEC_DIV */

    /* Subtract ADC offset */
    adcCounts -= ADC_1_Offset;

    mVolts = (int16)(( adcCounts * ADC_1_1MV_COUNTS ) / ADC_1_CountsPerVolt) ;

    return(mVolts);
}


/*******************************************************************************
* Function Name: ADC_1_CountsTo_Volts
********************************************************************************
*
* Summary:
*  Converts the ADC output to Volts as a floating point number. For
*  example, if the ADC measure a voltage of 1.2345 Volts, the
*  returned result would be +1.2345 Volts.
*
* Parameters:
*  int32 adcCounts:  Result from the ADC conversion.
*
* Return:
*  float32: Result in Volts
*
* Global variables:
*  ADC_1_CountsPerVolt:  used to convert to Volts.
*  ADC_1_Offset:  Used as the offset while converting ADC counts
*   to Volts.
*
*******************************************************************************/
float32 ADC_1_CountsTo_Volts(int32 adcCounts) 
{

    float32 Volts;

    /* Convert adcCounts to the right align if left option selected */
    #if(ADC_1_CFG1_DEC_DIV != 0)
        if(ADC_1_Config == ADC_1_CFG1)
        {
            adcCounts /= ADC_1_CFG1_DEC_DIV;
        }
    #endif /* ADC_1_CFG1_DEC_DIV */
    #if((ADC_1_CFG2_DEC_DIV != 0) && (ADC_1_DEFAULT_NUM_CONFIGS > 1))
        if(ADC_1_Config == ADC_1_CFG2)
        {
            adcCounts /= ADC_1_CFG2_DEC_DIV;
        }
    #endif /* ADC_1_CFG2_DEC_DIV */
    #if((ADC_1_CFG3_DEC_DIV != 0) && (ADC_1_DEFAULT_NUM_CONFIGS > 2))
        if(ADC_1_Config == ADC_1_CFG3)
        {
            adcCounts /= ADC_1_CFG3_DEC_DIV;
        }
    #endif /* ADC_1_CFG2_DEC_DIV */
    #if((ADC_1_CFG4_DEC_DIV != 0) && (ADC_1_DEFAULT_NUM_CONFIGS > 3))
        if(ADC_1_Config == ADC_1_CFG4)
        {
            adcCounts /= ADC_1_CFG4_DEC_DIV;
        }
    #endif /* ADC_1_CFG2_DEC_DIV */

    /* Subtract ADC offset */
    adcCounts -= ADC_1_Offset;

    Volts = (float32)adcCounts / (float32)ADC_1_CountsPerVolt;

    return( Volts );
}


/*******************************************************************************
* Function Name: ADC_1_CountsTo_uVolts
********************************************************************************
*
* Summary:
*  Converts the ADC output to uVolts as a 32-bit integer. For example,
*  if the ADC measured -0.02345 Volts, the return value would be -23450 uVolts.
*
* Parameters:
*  int32 adcCounts: Result from the ADC conversion.
*
* Return:
*  int32:  Result in uVolts
*
* Global variables:
*  ADC_1_CountsPerVolt:  used to convert ADC counts to mVolts.
*  ADC_1_Offset:  Used as the offset while converting ADC counts
*   to mVolts.
*
* Theory:
*  Care must be taken to not exceed the maximum value for a 31 bit signed
*  number in the conversion to uVolts and at the same time not lose resolution.
*
*  uVolts = ((A * adcCounts) / ((int32)ADC_1_CountsPerVolt / B));
*
*******************************************************************************/
int32 ADC_1_CountsTo_uVolts(int32 adcCounts) 
{

    int32 uVolts;
    int32 coefA;
    int32 coefB;
    uint8 resolution;

    /* Set the resolution based on the configuration */
    /* Convert adcCounts to the right align if left option selected */
    if (ADC_1_Config == ADC_1_CFG1)
    {
        resolution = ADC_1_CFG1_RESOLUTION;
        #if(ADC_1_CFG1_DEC_DIV != 0)
            adcCounts /= ADC_1_CFG1_DEC_DIV;
        #endif /* ADC_1_CFG1_DEC_DIV */
    }
    else if (ADC_1_Config == ADC_1_CFG2)
    {
        resolution = ADC_1_CFG2_RESOLUTION;
        #if(ADC_1_CFG2_DEC_DIV != 0)
            adcCounts /= ADC_1_CFG2_DEC_DIV;
        #endif /* ADC_1_CFG2_DEC_DIV */
    }
    else if (ADC_1_Config == ADC_1_CFG3)
    {
        resolution = ADC_1_CFG3_RESOLUTION;
        #if(ADC_1_CFG3_DEC_DIV != 0)
            adcCounts /= ADC_1_CFG3_DEC_DIV;
        #endif /* ADC_1_CFG3_DEC_DIV */
    }
    else
    {
        resolution = ADC_1_CFG4_RESOLUTION;
        #if(ADC_1_CFG4_DEC_DIV != 0)
            adcCounts /= ADC_1_CFG4_DEC_DIV;
        #endif /* ADC_1_CFG4_DEC_DIV */
    }

    switch (resolution)
    {
        #if( (ADC_1_CFG1_RESOLUTION == ADC_1__BITS_12) || \
             (ADC_1_CFG2_RESOLUTION == ADC_1__BITS_12) || \
             (ADC_1_CFG3_RESOLUTION == ADC_1__BITS_12) || \
             (ADC_1_CFG4_RESOLUTION == ADC_1__BITS_12) )
            case (uint8)ADC_1__BITS_12:
                coefA = ADC_1_1UV_COUNTS / ADC_1_DIVISOR_2;
                coefB = ADC_1_DIVISOR_2;
                break;
        #endif /* ADC_1__BITS_12 */    
        #if( (ADC_1_CFG1_RESOLUTION == ADC_1__BITS_13) || \
             (ADC_1_CFG2_RESOLUTION == ADC_1__BITS_13) || \
             (ADC_1_CFG3_RESOLUTION == ADC_1__BITS_13) || \
             (ADC_1_CFG4_RESOLUTION == ADC_1__BITS_13) )
            case (uint8)ADC_1__BITS_13:
                coefA = ADC_1_1UV_COUNTS / ADC_1_DIVISOR_4;
                coefB = ADC_1_DIVISOR_4;
                break;
        #endif /* ADC_1__BITS_13 */    
        #if( (ADC_1_CFG1_RESOLUTION == ADC_1__BITS_14) || \
             (ADC_1_CFG2_RESOLUTION == ADC_1__BITS_14) || \
             (ADC_1_CFG3_RESOLUTION == ADC_1__BITS_14) || \
             (ADC_1_CFG4_RESOLUTION == ADC_1__BITS_14) )
            case (uint8)ADC_1__BITS_14:
                coefA = ADC_1_1UV_COUNTS / ADC_1_DIVISOR_8;
                coefB = ADC_1_DIVISOR_8;
                break;
        #endif /* ADC_1__BITS_14 */    
        #if( (ADC_1_CFG1_RESOLUTION == ADC_1__BITS_15) || \
             (ADC_1_CFG2_RESOLUTION == ADC_1__BITS_15) || \
             (ADC_1_CFG3_RESOLUTION == ADC_1__BITS_15) || \
             (ADC_1_CFG4_RESOLUTION == ADC_1__BITS_15) )
            case (uint8)ADC_1__BITS_15:
                coefA = ADC_1_1UV_COUNTS / ADC_1_DIVISOR_16;
                coefB = ADC_1_DIVISOR_16;
                break;
        #endif /* ADC_1__BITS_15 */    
        #if( (ADC_1_CFG1_RESOLUTION == ADC_1__BITS_16) || \
             (ADC_1_CFG2_RESOLUTION == ADC_1__BITS_16) || \
             (ADC_1_CFG3_RESOLUTION == ADC_1__BITS_16) || \
             (ADC_1_CFG4_RESOLUTION == ADC_1__BITS_16) )
            case (uint8)ADC_1__BITS_16:
                coefA = ADC_1_1UV_COUNTS / ADC_1_DIVISOR_32;
                coefB = ADC_1_DIVISOR_32;
                break;
        #endif /* ADC_1__BITS_16 */    
        #if( (ADC_1_CFG1_RESOLUTION == ADC_1__BITS_17) || \
             (ADC_1_CFG2_RESOLUTION == ADC_1__BITS_17) || \
             (ADC_1_CFG3_RESOLUTION == ADC_1__BITS_17) || \
             (ADC_1_CFG4_RESOLUTION == ADC_1__BITS_17) )
            case (uint8)ADC_1__BITS_17:
                coefA = ADC_1_1UV_COUNTS / ADC_1_DIVISOR_64;
                coefB = ADC_1_DIVISOR_64;
                break;
        #endif /* ADC_1__BITS_17 */    
        #if( (ADC_1_CFG1_RESOLUTION == ADC_1__BITS_18) || \
             (ADC_1_CFG2_RESOLUTION == ADC_1__BITS_18) || \
             (ADC_1_CFG3_RESOLUTION == ADC_1__BITS_18) || \
             (ADC_1_CFG4_RESOLUTION == ADC_1__BITS_18) )
            case (uint8)ADC_1__BITS_18:
                coefA = ADC_1_1UV_COUNTS / ADC_1_DIVISOR_125;
                coefB = ADC_1_DIVISOR_125;
                break;
        #endif /* ADC_1__BITS_18 */    
        #if( (ADC_1_CFG1_RESOLUTION == ADC_1__BITS_19) || \
             (ADC_1_CFG2_RESOLUTION == ADC_1__BITS_19) || \
             (ADC_1_CFG3_RESOLUTION == ADC_1__BITS_19) || \
             (ADC_1_CFG4_RESOLUTION == ADC_1__BITS_19) )
            case (uint8)ADC_1__BITS_19:
                coefA = ADC_1_1UV_COUNTS / ADC_1_DIVISOR_250;
                coefB = ADC_1_DIVISOR_250;
                break;
        #endif /* ADC_1__BITS_19 */    
        #if( (ADC_1_CFG1_RESOLUTION == ADC_1__BITS_20) || \
             (ADC_1_CFG2_RESOLUTION == ADC_1__BITS_20) || \
             (ADC_1_CFG3_RESOLUTION == ADC_1__BITS_20) || \
             (ADC_1_CFG4_RESOLUTION == ADC_1__BITS_20) )
            case (uint8)ADC_1__BITS_20:
                coefA = ADC_1_1UV_COUNTS / ADC_1_DIVISOR_500;
                coefB = ADC_1_DIVISOR_500;
                break;
        #endif /* ADC_1__BITS_20 */    
        default:    /* resolution < 12 */
            /* 11 bits ADC + 2^20(1048576) = 31 bits */
            coefA = ADC_1_1UV_COUNTS;
            coefB = ADC_1_DIVISOR_1;
            break;
    }
    coefB = ADC_1_CountsPerVolt / coefB;
    uVolts = ((coefA * adcCounts) / coefB) - ((coefA * ADC_1_Offset) / coefB);

