NMMI/SoftHand2/firmware.cydsn/Generated_Source/PSoC3/ADC_1.c
    return( uVolts );
}


/*******************************************************************************
* Function Name: ADC_1_InitConfig(uint8 config)
********************************************************************************
*
* Summary:
*  Initializes all registers based on customizer settings
*
* Parameters:
*   void
*
* Return:
*  None
*
* Global variables:
*  ADC_1_CountsPerVolt:  Used to set the default counts per volt.
*
* Side Effects: Rewrites the coherency set by ADC_1_SetCoherency()
*   API to the default value.
*
*******************************************************************************/
static void ADC_1_InitConfig(uint8 config) 
{
    ADC_1_stopConversion = 0u;

    if (config == 1u)
    {
        /* Default Config */
        ADC_1_DEC_CR_REG      = ADC_1_CFG1_DEC_CR;
        ADC_1_DEC_SHIFT1_REG  = ADC_1_CFG1_DEC_SHIFT1;
        ADC_1_DEC_SHIFT2_REG  = ADC_1_CFG1_DEC_SHIFT2;
        ADC_1_DEC_DR2_REG     = ADC_1_CFG1_DEC_DR2;
        ADC_1_DEC_DR2H_REG    = ADC_1_CFG1_DEC_DR2H;
        ADC_1_DEC_DR1_REG     = ADC_1_CFG1_DEC_DR1;
        ADC_1_DEC_OCOR_REG    = ADC_1_CFG1_DEC_OCOR;
        ADC_1_DEC_OCORM_REG   = ADC_1_CFG1_DEC_OCORM;
        ADC_1_DEC_OCORH_REG   = ADC_1_CFG1_DEC_OCORH;
        ADC_1_DEC_COHER_REG   = ADC_1_CFG1_DEC_COHER;

        ADC_1_DSM_CR4_REG     = ADC_1_CFG1_DSM_CR4;
        ADC_1_DSM_CR5_REG     = ADC_1_CFG1_DSM_CR5;
        ADC_1_DSM_CR6_REG     = ADC_1_CFG1_DSM_CR6;
        ADC_1_DSM_CR7_REG     = ADC_1_CFG1_DSM_CR7;
        ADC_1_DSM_CR10_REG    = ADC_1_CFG1_DSM_CR10;
        ADC_1_DSM_CR11_REG    = ADC_1_CFG1_DSM_CR11;
        ADC_1_DSM_CR12_REG    = ADC_1_CFG1_DSM_CR12;
        ADC_1_DSM_CR14_REG    = ADC_1_CFG1_DSM_CR14;
        ADC_1_DSM_CR15_REG    = ADC_1_CFG1_DSM_CR15;
        ADC_1_DSM_CR16_REG    = ADC_1_CFG1_DSM_CR16;
        ADC_1_DSM_CR17_REG    = ADC_1_CFG1_DSM_CR17;
        /* Set DSM_REF0_REG by disabling and enabling the PRESS circuit */
        ADC_1_SetDSMRef0Reg(ADC_1_CFG1_DSM_REF0);
        ADC_1_DSM_REF2_REG    = ADC_1_CFG1_DSM_REF2;
        ADC_1_DSM_REF3_REG    = ADC_1_CFG1_DSM_REF3;

        ADC_1_DSM_BUF0_REG    = ADC_1_CFG1_DSM_BUF0;
        ADC_1_DSM_BUF1_REG    = ADC_1_CFG1_DSM_BUF1;
        ADC_1_DSM_BUF2_REG    = ADC_1_CFG1_DSM_BUF2;
        ADC_1_DSM_BUF3_REG    = ADC_1_CFG1_DSM_BUF3;

        /* To select either Vssa or Vref to -ve input of DSM depending on
        *  the input  range selected.
        */
        #if(ADC_1_DEFAULT_INPUT_MODE)
            #if (ADC_1_CFG1_INPUT_RANGE == ADC_1_IR_VSSA_TO_2VREF)
                ADC_1_AMux_Select(1u);
            #else
                ADC_1_AMux_Select(0u);
            #endif /* ADC_1_IR_VSSA_TO_2VREF) */
        #endif /* ADC_1_DEFAULT_INPUT_MODE */

        /* Set the Conversion stop if resolution is above 16 bit and conversion
        *   mode is Single sample
        */
        #if(ADC_1_CFG1_RESOLUTION > 16 && \
            ADC_1_CFG1_CONV_MODE == ADC_1_MODE_SINGLE_SAMPLE)
            ADC_1_stopConversion = 1u;
        #endif /* Single sample with resolution above 16 bits. */

        ADC_1_CountsPerVolt = (int32)ADC_1_CFG1_COUNTS_PER_VOLT;

        ADC_1_Ext_CP_Clk_SetDividerRegister(ADC_1_CFG1_CP_CLK_DIVIDER, 1u);

        /* This is only valid if there is an internal clock */
        #if(ADC_1_DEFAULT_INTERNAL_CLK)
            ADC_1_theACLK_SetDividerRegister(ADC_1_CFG1_ADC_CLK_DIVIDER, 1u);
        #endif /* ADC_1_DEFAULT_INTERNAL_CLK */

        #if(ADC_1_IRQ_REMOVE == 0u)
            /* Set interrupt vector */
            (void)CyIntSetVector(ADC_1_INTC_NUMBER, &ADC_1_ISR1);
        #endif   /* End ADC_1_IRQ_REMOVE */
    }

    #if(ADC_1_DEFAULT_NUM_CONFIGS > 1)
        if(config == 2u)
        {
            /* Second Config */
            ADC_1_DEC_CR_REG      = ADC_1_CFG2_DEC_CR;
            ADC_1_DEC_SHIFT1_REG  = ADC_1_CFG2_DEC_SHIFT1;
            ADC_1_DEC_SHIFT2_REG  = ADC_1_CFG2_DEC_SHIFT2;
            ADC_1_DEC_DR2_REG     = ADC_1_CFG2_DEC_DR2;
            ADC_1_DEC_DR2H_REG    = ADC_1_CFG2_DEC_DR2H;
            ADC_1_DEC_DR1_REG     = ADC_1_CFG2_DEC_DR1;
            ADC_1_DEC_OCOR_REG    = ADC_1_CFG2_DEC_OCOR;
            ADC_1_DEC_OCORM_REG   = ADC_1_CFG2_DEC_OCORM;
            ADC_1_DEC_OCORH_REG   = ADC_1_CFG2_DEC_OCORH;
            ADC_1_DEC_COHER_REG   = ADC_1_CFG2_DEC_COHER;

            ADC_1_DSM_CR4_REG     = ADC_1_CFG2_DSM_CR4;
            ADC_1_DSM_CR5_REG     = ADC_1_CFG2_DSM_CR5;
            ADC_1_DSM_CR6_REG     = ADC_1_CFG2_DSM_CR6;
            ADC_1_DSM_CR7_REG     = ADC_1_CFG2_DSM_CR7;
            ADC_1_DSM_CR10_REG    = ADC_1_CFG2_DSM_CR10;
            ADC_1_DSM_CR11_REG    = ADC_1_CFG2_DSM_CR11;
            ADC_1_DSM_CR12_REG    = ADC_1_CFG2_DSM_CR12;
            ADC_1_DSM_CR14_REG    = ADC_1_CFG2_DSM_CR14;
            ADC_1_DSM_CR15_REG    = ADC_1_CFG2_DSM_CR15;
            ADC_1_DSM_CR16_REG    = ADC_1_CFG2_DSM_CR16;
            ADC_1_DSM_CR17_REG    = ADC_1_CFG2_DSM_CR17;
            /* Set DSM_REF0_REG by disabling and enabling the PRESS cirucit */
            ADC_1_SetDSMRef0Reg(ADC_1_CFG2_DSM_REF0);
            ADC_1_DSM_REF2_REG    = ADC_1_CFG2_DSM_REF2;
            ADC_1_DSM_REF3_REG    = ADC_1_CFG2_DSM_REF3;

            ADC_1_DSM_BUF0_REG    = ADC_1_CFG2_DSM_BUF0;
            ADC_1_DSM_BUF1_REG    = ADC_1_CFG2_DSM_BUF1;
            ADC_1_DSM_BUF2_REG    = ADC_1_CFG2_DSM_BUF2;
            ADC_1_DSM_BUF3_REG    = ADC_1_CFG2_DSM_BUF3;

            /* To select either Vssa or Vref to -ve input of DSM depending on
            *  the input range selected.
            */

            #if(ADC_1_DEFAULT_INPUT_MODE)
                #if (ADC_1_CFG2_INPUT_RANGE == ADC_1_IR_VSSA_TO_2VREF)
                    ADC_1_AMux_Select(1u);
                #else
                    ADC_1_AMux_Select(0u);
                #endif /* ADC_1_IR_VSSA_TO_2VREF) */
            #endif /* ADC_1_DEFAULT_INPUT_MODE */

            /* Set the Conversion stop if resolution is above 16 bit and
            *   conversion mode is Single sample
            */
            #if(ADC_1_CFG2_RESOLUTION > 16 && \
                ADC_1_CFG2_CONV_MODE == ADC_1_MODE_SINGLE_SAMPLE)
                ADC_1_stopConversion = 1u;
            #endif /* Single sample with resolution above 16 bits. */

