NMMI/SoftHand2/firmware.cydsn/Generated_Source/PSoC3/ADC_1.c
/******************************************************************************
* Function Name: ADC_1_SetDSMRef0Reg(uint8)
******************************************************************************
*
* Summary:
*  This API sets the DSM_REF0 register. This is written for internal use.
*
* Parameters:
*  value:  Value to be written to DSM_REF0 register.
*
* Return:
*  None
*
******************************************************************************/
static void ADC_1_SetDSMRef0Reg(uint8 value) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable PRES */
    ADC_1_RESET_CR4_REG |= (ADC_1_IGNORE_PRESA1 | ADC_1_IGNORE_PRESD1);
    ADC_1_RESET_CR5_REG |= (ADC_1_IGNORE_PRESA2 | ADC_1_IGNORE_PRESD2);
    ADC_1_DSM_REF0_REG = value;

    /* Wait for 3 microseconds */
    CyDelayUs(ADC_1_PRES_DELAY_TIME);
    /* Enable the press circuit */
    ADC_1_RESET_CR4_REG &= (uint8)~(ADC_1_IGNORE_PRESA1 | ADC_1_IGNORE_PRESD1);
    ADC_1_RESET_CR5_REG &= (uint8)~(ADC_1_IGNORE_PRESA2 | ADC_1_IGNORE_PRESD2);

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: ADC_1_Read8
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*  None
*
* Return:
*  int8:  ADC result.
*
*******************************************************************************/
int8 ADC_1_Read8(void) 
{
    int8 result;

    /* Clear pending conversion done status */
    ADC_1_DEC_SR_REG |= ADC_1_DEC_INTR_CLEAR;
    ADC_1_StartConvert();
    (void)ADC_1_IsEndConversion(ADC_1_WAIT_FOR_RESULT);
     result = ADC_1_GetResult8();
    ADC_1_StopConvert();
    
     return(result);
}


/*******************************************************************************
* Function Name: ADC_1_Read16
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*   void
*
* Return:
*  int16:  ADC result.
*
*******************************************************************************/
int16 ADC_1_Read16(void) 
{
    int16 result;

    /* Clear pending conversion done status */
    ADC_1_DEC_SR_REG |= ADC_1_DEC_INTR_CLEAR;
    ADC_1_StartConvert();
    (void)ADC_1_IsEndConversion(ADC_1_WAIT_FOR_RESULT);
     result = ADC_1_GetResult16();
    ADC_1_StopConvert();
    
     return(result);
}


/*******************************************************************************
* Function Name: ADC_1_Read32
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*  None
*
* Return:
*  int32: ADC result.
*
*******************************************************************************/
int32 ADC_1_Read32(void) 
{
    int32 result;
    
    /* Clear pending conversion done status */
    ADC_1_DEC_SR_REG |= ADC_1_DEC_INTR_CLEAR;
    ADC_1_StartConvert();
    (void)ADC_1_IsEndConversion(ADC_1_WAIT_FOR_RESULT);
     result = ADC_1_GetResult32();
    ADC_1_StopConvert();
    
     return(result);
}


/* [] END OF FILE */
